app/Http/Controllers/Front/HomeController.php

select `category`.* from `category` inner join `products` on `products`.`category_id` = `category`.`id` inner join `product_variations` on `product_variations`.`product_id` = `products`.`id` where `category`.`status` = 'AC' and `products`.`status` = 'AC' and `product_variations`.`status` = 'AC' group by `category`.`id`
select * from `product_variations` where `product_variations`.`product_id` in (6, 14, 43, 408, 418, 483, 519, 520) and `status` = 'AC'
select * from `category` where `status` = 'AC' and `category`.`id` = '9' limit 1
select * from `sliders` where `status` = 'AC'
---
    public function index(Request $request) {
        $categories = Category::select("category.*")
            ->join('products', 'products.category_id', '=', 'category.id')
            ->join('product_variations', 'product_variations.product_id', '=', 'products.id')->where("category.status", "AC")
            ->where("products.status", "AC")
            ->where("product_variations.status", "AC")
            ->groupBy('category.id')
            ->get();


        $featured   = Product::active()->featured()->with('activevariations')
            ->whereHas('activevariations', function ($query) {return $query
            ->where('product_variations.status', 'AC');
            })
            ->get();

        $quickgrab  = Product::active()->quickgrab()
            ->whereHas('activevariations', function ($query) {return $query
            ->where('product_variations.status', 'AC');
            })
            ->get();

        $offered    = Product::active()->offered()
            ->whereHas('activevariations', function ($query) {return $query
            ->where('product_variations.status', 'AC');
            })
            ->get();

        $sliders    = Slider::active()->get();

select * from `category` where `category`.`id` in (2)
---
    public function showProduct($id) {

        $product    = Product::active()->with('activevariations','category')->findOrFail($id);
        $suggested  = Product::active()->where('category_id',$product->category_id)->inRandomOrder()->limit(8)->get();

select * from `products` where `status` = 'AC' and `products`.`id` = '14' limit 1
---
    public function showCart() {

        $items = Cart::where('user_id',auth()->user()->id)->whereNull('order_id')->with('variation','product')
            ->whereHas('product', function($query) {$query->where('status','AC'); })
            ->whereHas('variation', function($query) {$query->where('status','AC'); })
            ->get();

select * from `faq_questions` where `status` = 'AC'
---
    public function showFaq() {

        $faqs = FAQQuestion::where('status', 'AC')->get();