app/Http/Controllers/Front/MyController.php

select * from `orders` where `user_id` = '42' order by `created_at` desc
---
    public function Orders() {
        $orders = Order::where('user_id','42')->latest()->get();