app/Model/Order.php

select * from `user_addresses` where (`id` = 28 and `status` = 'AC') limit 1
---
    public function get_user_delivery_address($address_id)
    {
        return UserAddress::where(['id' => $address_id, 'status' => 'AC'])->first();